from greek_stemmer import stemmer

#STEP 1 of processing
#Create a dictionary of stopwords, stem them and put the stemmed words into stopwords_stemmed.txt
output_file = "parliament-search/public/dictionary/stopwords_stemmed.txt"

l_keywords = set([
    #Βασικά (Άρθρα, Αντωνυμίες, Προθέσεις, Σύνδεσμοι) ---
    "ο", "γι", "η", "το", "οι", "τα", "του", "της", "ίδιος", "των", "τον", "τη", "την", "τις",
    "ένας", "μια", "μία", "ένα", "ενός", "μιας", "μίας", "δε", "ακριβώς", "εξής", "βέβαια",
    "στο", "στη", "στην", "στους", "στις", "στα", "στον", "είμαστε", "είμαι", "είστε","όλους","κανείς",
    "εγώ", "εσύ", "αυτός", "αυτή", "αυτό", "αυτόν", "αυτήν", "αυτού", "αυτής", "αυτών", "καλά",
    "εμείς", "εσείς", "αυτοί", "αυτές", "αυτά", "κατ", "απ", "πει", "ξέρω", 
    "μου", "σου", "του", "της", "μας", "σας", "τους", "δικός", "δική", "δικό", "εαυτού",
    "τούτος", "εκείνος", "τέτοιος", "τόσος", "όσο"
    "που", "ποιος", "ποια", "ποιο", "τι", "όποιος", "όποια", "όποιο", "οποίος", "οποία", 
    "οποίο", "οποιοσδήποτε", "πόσος",
    "κάποιος", "κάτι", "κανένας", "καμία", "κανένα", "καθένας", "καθεμία", "καθετί", "τίποτα",
    "από", "για", "με", "σε", "προς", "κατά", "παρά", "αντί", "δίχως", "χωρίς", "μέσω", "μετά", "πριν",
    "εν", "εκ", "επί", "περί", "υπό", "υπέρ", "ανά",
    "και", "κι", "αλλά", "ή", "είτε", "ούτε", "μήτε", "όμως", "ωστόσο", "επομένως",
    "ότι", "πως", "γιατί", "επειδή", "αφού", "ενώ", "καθώς", "αν", "εάν", "άμα", "ώστε", "μολονότι",
    "να", "θα", "ας", "μα", "δεν", "μη", "μην", "ως","ευχαριστούμε","όπως","ορίστε","όχι","ναι", "άρα", "πολλά",
    "άλλο","μάλιστα","λοιπόν", "διότι", "βεβαίως", "κάθε", "μέσα", "επίσης", "άλλη",
    #Ρήματα Ρουτίνας & Γενικά
    "είναι", "ήταν", "έχω", "είχε", "έχεις", "έχει", "έχετε", "έχουμε", "έχουν","είχατε",
    "κάνει", "κάνουμε", "κάνετε", "λέω", "λες", "λέτε", "λέμε", "νομίζω", "πιστεύω",
    "θέλω", "θέλουμε", "θέλετε", "πρέπει", "γίνεται", "φορά", "πράγμα", "πράγματα",
    "εδώ", "εκεί", "πού", "πώς", "πότε", "όλα", "όλοι", "όλες", "όλο", "κάνω", "μπορώ",
    "έτσι", "πολύ", "λίγο", "τώρα", "τότε", "πια", "πάλι", "ακόμα", "ήδη", "μόνο", "κ", "κο", "ξέρετε",    "ευχαριστούμε","μάλιστα","είπε", "αφορά", "λέει", "πάρα","κλείσει","πω","μπορεί","γίνει",
    "συνεπώς","δηλαδή","έγινε","ήθελα", "πείτε", "είπα", "ερωτάται", "υπάρχει", "υπάρχουν", "είπατε",

    #Προσφωνήσεις & Ευγένειες Βουλής 
    "κύριος","κύριε", "κυρία", "κύριοι", "κύριο", "κυρίες", "συνάδελφε", "συνάδελφος", "συνάδελφοι", "αγαπητέ", "αγαπητοί",
    "πρόεδρε", "υπουργέ","υπουργός","υπουργό", "υπουργείου", "υφυπουργέ", "βουλευτή","βουλευτής", "βουλευτές", 
    "παρακαλώ", "ευχαριστώ", "λόγο", "ομιλία", "τοποθέτηση", "χώρα",
    
    #Ορολογία Βουλής & Διαδικαστικά (Noise words για την ανάλυση) 
    "νομοσχέδιο", "σχέδιο", "νόμου", "νόμος", "νόμοι", "πολιτική", "όσων", "οσο",
    "άρθρο","άρθρου", "άρθρα", "διάταξη", "διατάξεις", "παράγραφος",
    "τροπολογία", "τροπολογίες", "επιτροπή", "επιτροπές", "τροποποιήθηκε",
    "ολομέλεια", "βουλή", "βουλής", "αίθουσα", "εδρανα",
    "πρακτικά", "συνεδρίαση", "ημερήσια", "διάταξη",
    "ψηφοφορία", "ψήφιση", "ψήφο", "συζήτηση", "ερώτηση", "επίκαιρη", "σώμα",
    "εισηγητής", "εισηγήτρια", "κοινοβουλευτικός", "εκπρόσωπος", 
    "κυβέρνηση", "κυβέρνησης", "αντιπολίτευση", "αξιωματική",
    "υπουργείο", "υπουργεία", "κόμμα", "κόμματα","υφυπουργός", "πλειοψηφία", "δεκτό", "θέμα",
    
    #Χρονικά & Ποσοτικά 
    "σήμερα", "χθες", "αύριο", "μεγάλο", "πρώτο", "φέτος", "πέρυσι","σύντομα","συγκεκριμένα", "παρών","όταν", "αριθμό",
    "έτος", "έτη", "χρόνια", "ημέρα", "μέρες", "χρόνο", "λεπτά", "ώρα","λεπτό", "στιγμή",
    "ευρώ", "εκατομμύρια", "δισεκατομμύρια", "χιλιάδες", "ποσό", "ποσά", "νούμερα",
    "ένα","ένας", "έναν", "δύο", "τρεις", "τρία", "τέσσερις", "πέντε","έξι","επτά", "δέκα", "μέχρι"
])


def create_stemmed_stopwords_file():
    
    unique_stems = set()
    
    for word in l_keywords:
        unique_stems.add(stemmer.stem_word(word.upper(), 'VBG').lower())
            
    with open(output_file, 'w', encoding='utf-8') as f:
        for s in sorted(unique_stems):
            f.write(s + '\n')
            
    print(f"Success! Created {output_file} with {len(unique_stems)} unique stems.")


create_stemmed_stopwords_file()